# 01 Pandas(판다스)

In [2]:
import pandas as pd

market = pd.Series(index = ['Apple', 'Banana', 'Carrot'],
                   data = [12, 5, 2])
market

Apple     12
Banana     5
Carrot     2
dtype: int64

In [3]:
import pandas as pd # pandas 패키지를 파이썬으로 불러오기

# 하와이안 피자가 아닌 피자 만들기
pizza = pd.Series(index = ['bread', 'olive', 'shrimp', 'sausage', 'pineapple'],
                  data = [1, 8, 6, 12, 'No'])

# Pandas Series
pizza

bread         1
olive         8
shrimp        6
sausage      12
pineapple    No
dtype: object

In [4]:
pizza.index

Index(['bread', 'olive', 'shrimp', 'sausage', 'pineapple'], dtype='object')

In [5]:
# 필요한 새우의 개수
print(pizza['shrimp'])

6

In [6]:
print(pizza[['olive', 'sausage']])

olive       8
sausage    12
dtype: object

In [8]:
print(pizza.loc[['olive', 'sausage']])

olive       8
sausage    12
dtype: object

In [9]:
# 필요한 새우와 소세지의 수
print(pizza.iloc[[2,3]])

shrimp      6
sausage    12
dtype: object

In [10]:
# 해당 인덱스에 value를 덮어 씌워 준다.
pizza['shrimp'] = 12

pizza

bread         1
olive         8
shrimp       12
sausage      12
pineapple    No
dtype: object

In [11]:
pizza.drop('pineapple', inplace=True)

pizza

bread       1
olive       8
shrimp     12
sausage    12
dtype: object

In [13]:
# pandas 패키지 불러오기
import pandas as pd

# 데이터를 딕셔너리로 정의
data = {
    '이름' : ['Alice', 'Bob', 'Charlie', 'David'],
    '나이' : [25, 30, 22, 28],
    '국적' : ['미국', '영국', '영국', '미국']
}

df = pd.DataFrame(data, index = ['학생1', '학생2', '학생3', '학생4'])

df

          이름  나이  국적
학생1    Alice  25  미국
학생2      Bob  30  영국
학생3  Charlie  22  영국
학생4    David  28  미국

In [14]:
# Value
df.values

array([['Alice', 25, '미국'],
       ['Bob', 30, '영국'],
       ['Charlie', 22, '영국'],
       ['David', 28, '미국']], dtype=object)

In [15]:
df.columns

Index(['이름', '나이', '국적'], dtype='object')

In [16]:
name = pd.DataFrame(df, columns = ['이름'])
print(name)

          이름
학생1    Alice
학생2      Bob
학생3  Charlie
학생4    David

In [17]:
who = df[['이름', '나이']]
print(who)

          이름  나이
학생1    Alice  25
학생2      Bob  30
학생3  Charlie  22
학생4    David  28

In [18]:
df.index

Index(['학생1', '학생2', '학생3', '학생4'], dtype='object')

In [19]:
Alice = pd.DataFrame(df, index = ['학생1'])
print(Alice)

        이름  나이  국적
학생1  Alice  25  미국

In [20]:
students = df.iloc[2]
print(students)

이름    Charlie
나이         22
국적         영국
Name: 학생3, dtype: object

In [23]:
# 취미 정보 추가
hobbies = ['등산', '음악', '독서', '영화감상']
df['취미'] = hobbies

print(df)

          이름  나이  국적    취미
학생1    Alice  25  미국    등산
학생2      Bob  30  영국    음악
학생3  Charlie  22  영국    독서
학생4    David  28  미국  영화감상

In [26]:
# 기존 데이터프레임 재설정 (취미 생성 전)
df = pd.DataFrame(data, index = ['학생1', '학생2', '학생3', '학생4'])

# 'Elsa' 추가
new_student = {'이름' : 'Elsa', '나이' : 24, '국적' : '프랑스'}

df.loc['학생5'] = new_student
print(df)

          이름  나이   국적
학생1    Alice  25   미국
학생2      Bob  30   영국
학생3  Charlie  22   영국
학생4    David  28   미국
학생5     Elsa  24  프랑스

In [27]:
# 나이삭제
df.pop('나이')
df

          이름   국적
학생1    Alice   미국
학생2      Bob   영국
학생3  Charlie   영국
학생4    David   미국
학생5     Elsa  프랑스

In [28]:
import pandas as pd

# 새로운 자료
data = {
    '제품명' : ['사과', '바나나', '딸기', '포도'],
    '가격' : [1000, 1500, pd.NA, 2000],
    '수량' : [3, pd.NA, 2, 4]
}

# 데이터프레임 생성
shopping_df = pd.DataFrame(data)

print(shopping_df)

   제품명    가격    수량
0   사과  1000     3
1  바나나  1500  <NA>
2   딸기  <NA>     2
3   포도  2000     4

In [29]:
shopping_df.isnull()

     제품명     가격     수량
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False

In [30]:
shopping_df.isnull().sum()

제품명    0
가격     1
수량     1
dtype: int64

In [33]:
# 0으로 대체
shopping_df_filled = shopping_df.fillna(0)

print(shopping_df_filled)

   제품명    가격  수량
0   사과  1000   3
1  바나나  1500   0
2   딸기     0   2
3   포도  2000   4

/var/folders/ld/7fj1069x6q7fr5894rwywdk40000gn/T/ipykernel_17864/4114429411.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  shopping_df_filled = shopping_df.fillna(0)

In [35]:
cleaned_df = shopping_df.dropna(axis = 0)

cleaned_df

  제품명    가격 수량
0  사과  1000  3
3  포도  2000  4

# 02 싸이킷런(scikit-learn)